Revit 2027 API
Hub.GetPointId Method
 Returns ElementId of the associated Point element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetPointId()
Public Function GetPointId As ElementId
public:
ElementId^ GetPointId()
member GetPointId : unit -> ElementId
Return Value
ElementId
 Returns the Point element Id or invalidElementId if there is no Hub assciated with this point.
See Also
Reference
Hub Class
Autodesk.Revit.DB.Structure Namespace